
// pay companies section
let companies = [
  {
    imgSrc: "images/Paypal.png",
    title: "باي بال",
    p: "هو خدمة علي الانتر نت تتيح للافراد والشركات ارسال واستلام الاموال بطريقة امنة وسهلة",
    ulTitle: "الميزات الرئيسية لباي بال",
    ul: {
      li1: "الحسابات الشخصية والتجارية",
      li2: "الامان",
      li3: "التكامل مع المتاجر الالكترونية",
      li4: "التحويلات المالية الدولية",
    },
  },
  {
    imgSrc: "images/instapay.png",
    title: "انستا باي",
    p: "هو خدمة علي الانتر نت تتيح للافراد والشركات ارسال واستلام الاموال بطريقة امنة وسهلة",
    ulTitle: "الميزات الرئيسية لباي بال",
    ul: {
      li1: "الحسابات الشخصية والتجارية",
      li2: "الامان",
      li3: "التكامل مع المتاجر الالكترونية",
      li4: "التحويلات المالية الدولية",
    },
  },
  {
    imgSrc: "images/opay.png",
    title: "او باي",
    p: "هو خدمة علي الانتر نت تتيح للافراد والشركات ارسال واستلام الاموال بطريقة امنة وسهلة",
    ulTitle: "الميزات الرئيسية لباي بال",
    ul: {
      li1: "الحسابات الشخصية والتجارية",
      li2: "الامان",
      li3: "التكامل مع المتاجر الالكترونية",
      li4: "التحويلات المالية الدولية",
    },
  },
  {
    imgSrc: "images/easycash.png",
    title: "ايزي كاش",
    p: "هو خدمة علي الانتر نت تتيح للافراد والشركات ارسال واستلام الاموال بطريقة امنة وسهلة",
    ulTitle: "الميزات الرئيسية لباي بال",
    ul: {
      li1: "الحسابات الشخصية والتجارية",
      li2: "الامان",
      li3: "التكامل مع المتاجر الالكترونية",
      li4: "التحويلات المالية الدولية",
    },
  },
  {
    imgSrc: "images/paymob.png",
    title: "باي موب",
    p: "هو خدمة علي الانتر نت تتيح للافراد والشركات ارسال واستلام الاموال بطريقة امنة وسهلة",
    ulTitle: "الميزات الرئيسية لباي بال",
    ul: {
      li1: "الحسابات الشخصية والتجارية",
      li2: "الامان",
      li3: "التكامل مع المتاجر الالكترونية",
      li4: "التحويلات المالية الدولية",
    },
  },
  {
    imgSrc: "images/damen.png",
    title: "ضامن",
    p: "هو خدمة علي الانتر نت تتيح للافراد والشركات ارسال واستلام الاموال بطريقة امنة وسهلة",
    ulTitle: "الميزات الرئيسية لباي بال",
    ul: {
      li1: "الحسابات الشخصية والتجارية",
      li2: "الامان",
      li3: "التكامل مع المتاجر الالكترونية",
      li4: "التحويلات المالية الدولية",
    },
  },
  {
    imgSrc: "images/fawry.png",
    title: "فوري باي",
    p: "هو خدمة علي الانتر نت تتيح للافراد والشركات ارسال واستلام الاموال بطريقة امنة وسهلة",
    ulTitle: "الميزات الرئيسية لباي بال",
    ul: {
      li1: "الحسابات الشخصية والتجارية",
      li2: "الامان",
      li3: "التكامل مع المتاجر الالكترونية",
      li4: "التحويلات المالية الدولية",
    },
  },
  {
    imgSrc: "images/stcpay.png",
    title: "stc باي",
    p: "هو خدمة علي الانتر نت تتيح للافراد والشركات ارسال واستلام الاموال بطريقة امنة وسهلة",
    ulTitle: "الميزات الرئيسية لباي بال",
    ul: {
      li1: "الحسابات الشخصية والتجارية",
      li2: "الامان",
      li3: "التكامل مع المتاجر الالكترونية",
      li4: "التحويلات المالية الدولية",
    },
  },
];
$(".overlay").hide();
$(".more").click(function () {
  let comId = $(this).data('id')
  $(".overlay .info .row").html(`<div class="col-md-3">
                        <img src="${companies[comId].imgSrc}" alt="paypal" class="img-fluid"> 
                    </div>
                    <div class="col-md-9">
                        <div class="content">
                            <h3>${companies[comId].title}</h3>
                            <p>${companies[comId].p}</p>
                            <ul>
                                <h4>${companies[comId].ulTitle}</h4>
                                <li>${companies[comId].ul.li1}</li>
                                <li>${companies[comId].ul.li2}</li>
                                <li>${companies[comId].ul.li3}</li>
                                <li>${companies[comId].ul.li4}</li>
                            </ul>
                            
                        </div>
                    </div>`);
  $(".overlay").fadeIn(500);
  $("body").css({ overflow: "hidden" });

});

$(".info").click(function (e) {
  e.stopPropagation();
});
$(".overlay").click(function () {
  $(this).fadeOut(500);
  $("body").css({ overflow: "auto" });
});
$(".fa-close").click(function () {
  $(".overlay").fadeOut(500);
  $("body").css({ overflow: "auto" });
});



// animation
AOS.init({
  once: true,
});